IDENTIFICATION DIVISION.
PROGRAM-ID.
    CBL1.
AUTHOR.
    JAS.
DATE-WRITTEN.
    09/16/80.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER.
    8080.
OBJECT-COMPUTER.
    8080.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT LINE-OUT-FILE ASSIGN
    CBL1.FIL.
DATA DIVISION.
FILE SECTION.
FD  LINE-OUT-FILE
    LABEL RECORDS
    OMITTED.
01  LINE-RECORD         PIC X(40).
PROCEDURE DIVISION.
WRITE-NAME-AND-ADDRESS.
    OPEN OUTPUT LINE-OUT-FILE.
    MOVE 'J.STRAUS' TO LINE-RECORD.
    WRITE LINE-RECORD.
    MOVE '2956 SAN CARLOS DR.' TO LINE-RECORD.
    WRITE LINE-RECORD.
    MOVE 'WALNUT CREEK CA.' TO LINE-RECORD.
    WRITE LINE-RECORD.
    CLOSE LINE-OUT-FILE.
    STOP RUN.
EOF
